## 5. –û–±–Ω–æ–≤–ª–µ–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö (UPDATE)

### üîÑ –û–±–Ω–æ–≤–ª–µ–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö (UPDATE)

**–ü–æ—Å—Ç–∞–Ω–æ–≤–∫–∞ –ø—Ä–æ–±–ª–µ–º—ã:**  
–ò–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è –º–æ–∂–µ—Ç –º–µ–Ω—è—Ç—å—Å—è. –ù–∞–ø—Ä–∏–º–µ—Ä, –∞–≤—Ç–æ—Ä –º–æ–∂–µ—Ç –∏–∑–º–µ–Ω–∏—Ç—å –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–Ω–∏–≥–∏, –∏–ª–∏ –Ω—É–∂–Ω–æ –∏—Å–ø—Ä–∞–≤–∏—Ç—å –æ—à–∏–±–∫—É –≤ –≥–æ–¥–µ. –î–ª—è —ç—Ç–æ–≥–æ –Ω—É–∂–Ω–æ —É–º–µ—Ç—å –æ–±–Ω–æ–≤–ª—è—Ç—å –¥–∞–Ω–Ω—ã–µ –≤ —Ç–∞–±–ª–∏—Ü–µ. –≠—Ç–æ –¥–µ–ª–∞–µ—Ç—Å—è —Å –ø–æ–º–æ—â—å—é –∫–æ–º–∞–Ω–¥—ã `UPDATE`.

**–ö—Ä–∞—Ç–∫–∞—è —Ç–µ–æ—Ä–∏—è:**  
`UPDATE` –∏–∑–º–µ–Ω—è–µ—Ç —Å—É—â–µ—Å—Ç–≤—É—é—â–∏–µ –∑–∞–ø–∏—Å–∏. –û–±—ã—á–Ω–æ –∏—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è —Å `WHERE`, —á—Ç–æ–±—ã –Ω–µ –∏–∑–º–µ–Ω–∏—Ç—å –≤—Å–µ —Å—Ç—Ä–æ–∫–∏ —Å—Ä–∞–∑—É.

**–°–∏–Ω—Ç–∞–∫—Å–∏—Å:**
```sql
UPDATE table_name SET column1 = value1, column2 = value2 WHERE condition;
```
–ï—Å–ª–∏ `WHERE` –Ω–µ —É–∫–∞–∑–∞—Ç—å ‚Äî –±—É–¥—É—Ç –æ–±–Ω–æ–≤–ª–µ–Ω—ã **–≤—Å–µ** —Å—Ç—Ä–æ–∫–∏ —Ç–∞–±–ª–∏—Ü—ã.

**–ü—Ä–∏–º–µ—Ä:**

In [ ]:
# –û–±–Ω–æ–≤–ª–µ–Ω–∏–µ –∑–∞–ø–∏—Å–µ–π –≤ SQLite
import sqlite3

conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# –°–æ–∑–¥–∞—ë–º —Ç–∞–±–ª–∏—Ü—É –∏ –¥–æ–±–∞–≤–ª—è–µ–º –¥–∞–Ω–Ω—ã–µ
cursor.execute('''
CREATE TABLE books (
    id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    author TEXT,
    year INTEGER
);
''')
books = [
    ("1984", "George Orwell", 1949),
    ("Brave New World", "Aldous Huxley", 1932)
]
cursor.executemany("INSERT INTO books (title, author, year) VALUES (?, ?, ?)", books)
conn.commit()

# –û–±–Ω–æ–≤–∏–º –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–Ω–∏–≥–∏
cursor.execute("UPDATE books SET title = 'Nineteen Eighty-Four' WHERE title = '1984'")
conn.commit()

# –ü–æ—Å–º–æ—Ç—Ä–∏–º —Ä–µ–∑—É–ª—å—Ç–∞—Ç
cursor.execute("SELECT * FROM books")
print("üìò –ü–æ—Å–ª–µ –æ–±–Ω–æ–≤–ª–µ–Ω–∏—è:")
for row in cursor.fetchall():
    print(row)